docs/modules/theme/freemacs-alltheicons.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-07-07 Thu 12:47 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>All the Icons Module</title>
<meta name="author" content="Thomas Freeman" />
<meta name="description" content="This org-mode file contains an org-babel implementation of the .emacs or .emacs.d/init.el file." />
<meta name="keywords" content="Emacs" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../../init.html"> UP </a>
 |
 <a accesskey="H" href="../../index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">All the Icons Module</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgc663d1f">1. All the Icons</a></li>
<li><a href="#orgfbd62ba">2. All the Icons Dired</a></li>
<li><a href="#org878c49c">3. All the Icons Ibuffer</a></li>
<li><a href="#org85a1e72">4. All the Icons Completion</a></li>
<li><a href="#org7a5f18f">5. End</a></li>
</ul>
</div>
</div>
<p>
This file sets up the configuration of All the Icons for Emacs.
</p>

<div id="outline-container-orgc663d1f" class="outline-2">
<h2 id="orgc663d1f"><span class="section-number-2">1.</span> All the Icons</h2>
<div class="outline-text-2" id="text-1">
<p>
<a href="https://github.com/domtronn/all-the-icons.el">All The Icons</a> adds some graphical elements to dired and the minibuffer. I find it makes it easier to see what types of files are being listed and it is just fun too.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">use-package</span> <span style="color: #df85ff; font-weight: bold;">all-the-icons</span>
  <span style="color: #1ea8fc;">:straight</span> t
  <span style="color: #1ea8fc;">:defer</span> t<span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfbd62ba" class="outline-2">
<h2 id="orgfbd62ba"><span class="section-number-2">2.</span> All the Icons Dired</h2>
<div class="outline-text-2" id="text-2">
<p>
<a href="https://github.com/jtbm37/all-the-icons-dired">All the Icons Dired</a> will add file-type icons to Dired while browsing files and directories. I find this very helpful to quickly have visual cues to find the correct files in the Dired buffer.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">use-package</span> <span style="color: #df85ff; font-weight: bold;">all-the-icons-dired</span>
  <span style="color: #1ea8fc;">:straight</span> t
  <span style="color: #1ea8fc;">:hook</span>
  <span style="color: #ff2afc;">(</span>dired-mode . all-the-icons-dired-mode<span style="color: #ff2afc;">)</span><span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org878c49c" class="outline-2">
<h2 id="org878c49c"><span class="section-number-2">3.</span> All the Icons Ibuffer</h2>
<div class="outline-text-2" id="text-3">
<p>
<a href="https://github.com/seagle0128/all-the-icons-ibuffer">All the Icons Ibuffer</a> adds icons representing different buffer types to Ibuffer mode.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">use-package</span> <span style="color: #df85ff; font-weight: bold;">all-the-icons-ibuffer</span>
  <span style="color: #1ea8fc;">:straight</span> t
  <span style="color: #1ea8fc;">:hook</span> <span style="color: #ff2afc;">(</span>ibuffer-mode . all-the-icons-ibuffer-mode<span style="color: #ff2afc;">)</span><span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org85a1e72" class="outline-2">
<h2 id="org85a1e72"><span class="section-number-2">4.</span> All the Icons Completion</h2>
<div class="outline-text-2" id="text-4">
<p>
<a href="https://github.com/iyefrat/all-the-icons-completion">All the Icons Completion</a> adds icons for many Emacs minibuffer completion systems so that files and directories will have icons in the minibuffer when called with <code>C-x C-f</code> and other similar commands.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">use-package</span> <span style="color: #df85ff; font-weight: bold;">all-the-icons-completion</span>
  <span style="color: #1ea8fc;">:straight</span> t
  <span style="color: #1ea8fc;">:defer</span> 3
  <span style="color: #1ea8fc;">:config</span>
  <span style="color: #ff2afc;">(</span>all-the-icons-completion-mode<span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span>add-hook 'marginalia-mode-hook #'all-the-icons-completion-marginalia-setup<span style="color: #ff2afc;">)</span><span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org7a5f18f" class="outline-2">
<h2 id="org7a5f18f"><span class="section-number-2">5.</span> End</h2>
<div class="outline-text-2" id="text-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">provide</span> '<span style="color: #df85ff; font-weight: bold;">freemacs-alltheicons</span><span style="color: #1ea8fc;">)</span>

<span style="color: #546A90;">;;; </span><span style="color: #546A90;">freemacs-alltheicons.el ends here</span>
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: Time-stamp: <span class="timestamp-wrapper"><span class="timestamp">&lt;2022-07-07 Thu 12:43&gt;</span></span></p>
<p class="author">Author: Thomas Freeman</p>
<p class="date">Created: 2022-07-07 Thu 12:47</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
